Revit 2027 API
AnalyticalElement.SetTransform Method
 Sets the transform of Analytical Element Local Coordinate System.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetTransform(
	Transform trf
)
Public Sub SetTransform (
	trf As Transform
)
public:
void SetTransform(
	Transform^ trf
)
member SetTransform :
        trf : Transform -> unit
Parameters
trf Transform
Exceptions
Exception | Condition
ArgumentException |  The provided transformation for Local Coordinate System is not valid.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace